# OutsideAirPerArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..OutsideAirPerArea Property
EnergyDataSettings Class See Also
---
The rate of flow of outside air available per unit area.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double OutsideAirPerArea { get; set; }
```

Visual Basic
---
```text
Public Property OutsideAirPerArea As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double OutsideAirPerArea {
	double get ();
	void set (double value);
}
```

# Remarks
Stored in cubic feet per hour per square foot.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The outside airPerArea does not fall within an appropriate range. |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace